QIFeng1S/STM32-ESP8266-OneNet-/OLED.c
#include "stm32f1xx_hal.h"
#include "Delay.h"
#include "OLED.h"
#include <string.h>
#include <stdint.h>              
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用OLED_Update函数或OLED_UpdateArea函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t OLED_DisplayBuf[8][128]; // OLED显示缓冲区

#ifdef OLED_I2C_4

//==============软件I2C实现部分================//
/*
*  软件I2C接口的GPIO定义
*  更改端口修改此处更改I2C的引脚
*/
#define I2C_SCL_GPIO_PORT    GPIOB
#define I2C_SCL_GPIO_PIN     GPIO_PIN_7

#define I2C_SDA_GPIO_PORT    GPIOB
#define I2C_SDA_GPIO_PIN     GPIO_PIN_8

/**
  * 函    数：OLED写SCL高低电平
  * 参    数：要写入SCL的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写SCL时，此函数会被调用
  *           用户需要根据参数传入的值，将SCL置为高电平或者低电平
  *           当参数传入0时，置SCL为低电平，当参数传入1时，置SCL为高电平
  */
static void I2C_SCL_Write(uint8_t value)
{
    HAL_GPIO_WritePin(I2C_SCL_GPIO_PORT, I2C_SCL_GPIO_PIN, 
                      (GPIO_PinState)value);
    Delay_us(10);
}

/**
  * 函    数：OLED写SDA高低电平
  * 参    数：要写入SDA的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写SDA时，此函数会被调用
  *           用户需要根据参数传入的值，将SDA置为高电平或者低电平
  *           当参数传入0时，置SDA为低电平，当参数传入1时，置SDA为高电平
  */
static void I2C_SDA_Write(uint8_t value)
{
    HAL_GPIO_WritePin(I2C_SDA_GPIO_PORT, I2C_SDA_GPIO_PIN, 
                      (GPIO_PinState)value);
    Delay_us(10);
}

static uint8_t I2C_SDA_Read(void)
{
    return HAL_GPIO_ReadPin(I2C_SDA_GPIO_PORT, I2C_SDA_GPIO_PIN);  
}

void OLED_I2C_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct ;
    
    /* 启用 GPIO 时钟 */
    __HAL_RCC_GPIOB_CLK_ENABLE();
    
    /* 配置 SCL 和 SDA 为开漏输出 */
    GPIO_InitStruct.Pin = I2C_SCL_GPIO_PIN | I2C_SDA_GPIO_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;      // 开漏输出
    GPIO_InitStruct.Pull = GPIO_NOPULL;               // 无上拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;     // 高速
    HAL_GPIO_Init(I2C_SCL_GPIO_PORT, &GPIO_InitStruct);
    
    /* 释放 I2C 总线 */
    I2C_SCL_Write(1);
    I2C_SDA_Write(1);
}

/**
  * 函    数：I2C起始
  * 参    数：无
  * 返 回 值：无
  */
void My_I2C_Start(void)
{
    I2C_SDA_Write(1);
    I2C_SCL_Write(1);
    I2C_SDA_Write(0);
    I2C_SCL_Write(0);
}

/**
  * 函    数：I2C终止
  * 参    数：无
  * 返 回 值：无
  */
void My_I2C_Stop(void)
{
    I2C_SDA_Write(0);
    I2C_SCL_Write(1);
    I2C_SDA_Write(1);
}

/**
  * 函    数：I2C发送一个字节
  * 参    数：Byte 要发送的一个字节数据，范围：0x00~0xFF
  * 返 回 值：无
  */
void MyI2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i ++)				
	{
		I2C_SDA_Write(Byte & (0x80 >> i));	
		I2C_SCL_Write(1);						
		I2C_SCL_Write(0);						
	}
}

uint8_t MyI2C_ReceiveByte(void)
{
	uint8_t i, Byte = 0x00;					
	I2C_SDA_Write(1);							
	for (i = 0; i < 8; i ++)				
	{
		I2C_SCL_Write(1);						
		if (I2C_SDA_Read() == 1){Byte |= (0x80 >> i);}	
														
		I2C_SCL_Write(0);						
	}
	return Byte;							
}

void MyI2C_SendAck(uint8_t AckBit)
{
	I2C_SDA_Write(AckBit);					//主机把应答位数据放到SDA线
	I2C_SCL_Write(1);							//释放SCL，从机在SCL高电平期间，读取应答位
	I2C_SCL_Write(0);							//拉低SCL，开始下一个时序模块
}

uint8_t MyI2C_ReceiveAck(void)
{
	uint8_t AckBit;							//定义应答位变量
	I2C_SDA_Write(1);							//接收前，主机先确保释放SDA，避免干扰从机的数据发送
	I2C_SCL_Write(1);							//释放SCL，主机机在SCL高电平期间读取SDA
	AckBit = I2C_SDA_Read();					//将应答位存储到变量里
	I2C_SCL_Write(0);							//拉低SCL，开始下一个时序模块
	return AckBit;							//返回定义应答位变量
}

//==============软件I2C实现部分================//

//==============OLED驱动部分==================//

/**
  * 函    数：OLED写命令
  * 参    数：Command 要写入的命令值，范围：0x00~0xFF
  * 返 回 值：无
  */
void OLED_WriteCommand(uint8_t command)
{
    My_I2C_Start();
    MyI2C_SendByte(0x78); // 发送设备地址
    MyI2C_ReceiveAck();   // 接收应答
    MyI2C_SendByte(0x00); // 发送命令标志  写命令d/c = 0.co = 0
    MyI2C_ReceiveAck();   // 接收应答
    MyI2C_SendByte(command); // 发送命令
    MyI2C_ReceiveAck();   // 接收应答
    My_I2C_Stop();
}

/**
  * 函    数：OLED写数据
  * 参    数：Data 要写入数据的起始地址
  * 参    数：Count 要写入数据的数量
  * 返 回 值：无
  */
void OLED_WriteData(uint8_t *data, uint8_t count)
{
    My_I2C_Start();
    MyI2C_SendByte(0x78); // 发送设备地址
    MyI2C_ReceiveAck();   // 接收应答
    MyI2C_SendByte(0x40); // 发送数据标志  写数据 d/c = 1.co = 0
    MyI2C_ReceiveAck();   // 接收应答
    for(uint8_t i = 0 ; i < count; i++)
    {
        MyI2C_SendByte(data[i]); // 发送数据
        MyI2C_ReceiveAck();   // 接收应答
    }
    My_I2C_Stop();
}

//==============OLED驱动部分==================//

#endif

//==============软件SPI实现部分================//
/*
*  软件SPI接口的GPIO定义
*  更改端口修改此处更改SPI的引脚
*/
#ifdef OLED_SPI_7

#define SPI_CLK_GPIO_PORT    GPIOB
#define SPI_CLK_GPIO_PIN     GPIO_PIN_12

#define SPI_MOSI_GPIO_PORT   GPIOB
#define SPI_MOSI_GPIO_PIN    GPIO_PIN_13

#define SPI_RES_GPIO_PORT    GPIOB
#define SPI_RES_GPIO_PIN     GPIO_PIN_14

#define SPI_DC_GPIO_PORT     GPIOB
#define SPI_DC_GPIO_PIN      GPIO_PIN_15

#define SPI_CS_GPIO_PORT     GPIOA
#define SPI_CS_GPIO_PIN      GPIO_PIN_8

/**
  * 函    数：OLED写D0（CLK）高低电平
  * 参    数：要写入D0的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写D0时，此函数会被调用
  *           用户需要根据参数传入的值，将D0置为高电平或者低电平
  *           当参数传入0时，置D0为低电平，当参数传入1时，置D0为高电平
  */
void OLED_W_D0(uint8_t value)
{
	/*根据value的值，将D0置高电平或者低电平*/
	HAL_GPIO_WritePin(SPI_CLK_GPIO_PORT, SPI_CLK_GPIO_PIN, (GPIO_PinState)value);
}

/**
  * 函    数：OLED写D1（MOSI）高低电平
  * 参    数：要写入D1的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写D1时，此函数会被调用
  *           用户需要根据参数传入的值，将D1置为高电平或者低电平
  *           当参数传入0时，置D1为低电平，当参数传入1时，置D1为高电平
  */
void OLED_W_D1(uint8_t value)
{
	/*根据value的值，将D1置高电平或者低电平*/
	HAL_GPIO_WritePin(SPI_MOSI_GPIO_PORT, SPI_MOSI_GPIO_PIN, (GPIO_PinState)value);
}

/**
  * 函    数：OLED写RES高低电平
  * 参    数：要写入RES的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写RES时，此函数会被调用
  *           用户需要根据参数传入的值，将RES置为高电平或者低电平
  *           当参数传入0时，置RES为低电平，当参数传入1时，置RES为高电平
  */
void OLED_W_RES(uint8_t value)
{
	/*根据value的值，将RES置高电平或者低电平*/
	HAL_GPIO_WritePin(SPI_RES_GPIO_PORT, SPI_RES_GPIO_PIN, (GPIO_PinState)value);
}

/**
  * 函    数：OLED写DC高低电平
  * 参    数：要写入DC的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写DC时，此函数会被调用
  *           用户需要根据参数传入的值，将DC置为高电平或者低电平
  *           当参数传入0时，置DC为低电平，当参数传入1时，置DC为高电平
  */
void OLED_W_DC(uint8_t value)
{
	/*根据value的值，将DC置高电平或者低电平*/
	HAL_GPIO_WritePin(SPI_DC_GPIO_PORT, SPI_DC_GPIO_PIN, (GPIO_PinState)value);
}

/**
  * 函    数：OLED写CS高低电平
  * 参    数：要写入CS的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写CS时，此函数会被调用
  *           用户需要根据参数传入的值，将CS置为高电平或者低电平
  *           当参数传入0时，置CS为低电平，当参数传入1时，置CS为高电平
  */
void OLED_W_CS(uint8_t value)
{
	/*根据BitValue的值，将CS置高电平或者低电平*/
	HAL_GPIO_WritePin(SPI_CS_GPIO_PORT, SPI_CS_GPIO_PIN, (GPIO_PinState)value);
}

/**
  * 函    数：OLED引脚初始化
  * 参    数：无
  * 返 回 值：无
  * 说    明：当上层函数需要初始化时，此函数会被调用
  *           用户需要将D0、D1、RES、DC和CS引脚初始化为推挽输出模式
  */
void OLED_SPI_GPIO_Init(void)
{
	uint32_t i, j;
	
